In [3]:
import numpy as np
import pandas as pd

In [129]:
data = pd.Series(np.random.uniform(size=9),
....: index=[["a", "a", "a", "b", "b", "c", "c", "d", "d"],
....: [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [130]:
data

a  1    0.001060
   2    0.464989
   3    0.034937
b  1    0.392305
   3    0.428955
c  1    0.648155
   2    0.208093
d  2    0.625287
   3    0.503255
dtype: float64

In [131]:
data["b"]

1    0.392305
3    0.428955
dtype: float64

In [139]:
 data["b":"d"]

b  1    0.392305
   3    0.428955
c  1    0.648155
   2    0.208093
d  2    0.625287
   3    0.503255
dtype: float64

In [19]:
 data.loc[["b", "d"]]

b  1    0.386879
   3    0.985344
d  2    0.621537
   3    0.773846
dtype: float64

In [21]:
 data.unstack()

          1         2         3
a  0.308975  0.175078  0.814341
b  0.386879       NaN  0.985344
c  0.876815  0.877782       NaN
d       NaN  0.621537  0.773846

In [ ]:
#MERGE DATAFRAMES

In [23]:
df1 = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "a", "b"],
....: "data1": pd.Series(range(7), dtype="Int64")})

In [25]:
df2 = pd.DataFrame({"key": ["a", "b", "d"],
....: "data2": pd.Series(range(3), dtype="Int64")})

In [27]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [29]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [31]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [33]:
df3 = pd.DataFrame({"lkey": ["b", "b", "a", "c", "a", "a", "b"],
....: "data1": pd.Series(range(7), dtype="Int64")})

In [35]:
df4 = pd.DataFrame({"rkey": ["a", "b", "d"],
....: "data2": pd.Series(range(3), dtype="Int64")})

In [37]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [39]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [43]:
 pd.merge(df3, df4, left_on="lkey", right_on="rkey")
#default inner join quindi non ci sono c e d

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    a      2    a      0
3    a      4    a      0
4    a      5    a      0
5    b      6    b      1

In [45]:
df1 = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
....: "data1": pd.Series(range(6), dtype="Int64")})

In [47]:
df2 = pd.DataFrame({"key": ["a", "b", "a", "b", "d"],
....: "data2": pd.Series(range(5), dtype="Int64")})

In [49]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [51]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [53]:
pd.merge(df1, df2, on="key", how="left")

   key  data1  data2
0    b      0      1
1    b      0      3
2    b      1      1
3    b      1      3
4    a      2      0
5    a      2      2
6    c      3   <NA>
7    a      4      0
8    a      4      2
9    b      5      1
10   b      5      3

In [55]:
s1 = pd.Series([0, 1], index=["a", "b"], dtype="Int64")
s2 = pd.Series([2, 3, 4], index=["c", "d", "e"], dtype="Int64")
s3 = pd.Series([5, 6], index=["f", "g"], dtype="Int64")

In [57]:
s1

a    0
b    1
dtype: Int64

In [59]:
s2

c    2
d    3
e    4
dtype: Int64

In [61]:
s3

f    5
g    6
dtype: Int64

In [63]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: Int64

In [65]:
pd.concat([s1, s2, s3], axis="columns")

      0     1     2
a     0  <NA>  <NA>
b     1  <NA>  <NA>
c  <NA>     2  <NA>
d  <NA>     3  <NA>
e  <NA>     4  <NA>
f  <NA>  <NA>     5
g  <NA>  <NA>     6

In [67]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=["a", "b", "c"],
.....: columns=["one", "two"])
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=["a", "c"],
.....: columns=["three", "four"])

In [69]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [71]:
df2

   three  four
a      5     6
c      7     8

In [73]:
pd.concat([df1, df2], axis="columns", keys=["level1", "level2"])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [75]:
 df1 = pd.DataFrame({"a": [1., np.nan, 5., np.nan],
.....: "b": [np.nan, 2., np.nan, 6.],
.....: "c": range(2, 18, 4)})
df2 = pd.DataFrame({"a": [5., 4., np.nan, 3., 7.],
.....: "b": [np.nan, 3., 4., 6., 8.]})

In [77]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [79]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [81]:
 df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [83]:
data = {
    'Date': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02'],
    'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles'],
    'Temperature': [30, 40, 25, 35]
}
df = pd.DataFrame(data)

In [85]:
df

         Date         City  Temperature
0  2023-01-01     New York           30
1  2023-01-01  Los Angeles           40
2  2023-01-02     New York           25
3  2023-01-02  Los Angeles           35

In [87]:
pivot_df = df.pivot(index='Date', columns='City', values='Temperature')

In [89]:
pivot_df

City        Los Angeles  New York
Date
2023-01-01           40        30
2023-01-02           35        25

In [91]:
data = {
    'Year': [2021, 2021, 2022, 2022],
    'Quarter': ['Q1', 'Q2', 'Q1', 'Q2'],
    'Region': ['North', 'South', 'North', 'South'],
    'Sales': [500, 700, 600, 800]
}
df = pd.DataFrame(data)

In [93]:
df

   Year Quarter Region  Sales
0  2021      Q1  North    500
1  2021      Q2  South    700
2  2022      Q1  North    600
3  2022      Q2  South    800

In [95]:
pivot_df = df.pivot(index=['Year', 'Quarter'], columns='Region', values='Sales')

In [97]:
pivot_df

Region        North  South
Year Quarter
2021 Q1       500.0    NaN
     Q2         NaN  700.0
2022 Q1       600.0    NaN
     Q2         NaN  800.0

In [99]:
data = {
    'Category': ['Electronics', 'Electronics', 'Furniture', 'Furniture', 'Electronics'],
    'SubCategory': ['Phone', 'TV', 'Chair', 'Table', 'Laptop'],
    'Store': ['A', 'A', 'B', 'B', 'A'],
    'Revenue': [200, 300, 150, 400, None],
    'Profit': [50, 70, 30, 80, None]
}
df = pd.DataFrame(data)

In [101]:
df

      Category SubCategory Store  Revenue  Profit
0  Electronics       Phone     A    200.0    50.0
1  Electronics          TV     A    300.0    70.0
2    Furniture       Chair     B    150.0    30.0
3    Furniture       Table     B    400.0    80.0
4  Electronics      Laptop     A      NaN     NaN

In [107]:
pivot_df = df.pivot(index=['Category','SubCategory'], columns='Store', values=['Revenue', 'Profit'])

In [109]:
pivot_df

                        Revenue        Profit
Store                         A      B      A     B
Category    SubCategory
Electronics Laptop          NaN    NaN    NaN   NaN
            Phone         200.0    NaN   50.0   NaN
            TV            300.0    NaN   70.0   NaN
Furniture   Chair           NaN  150.0    NaN  30.0
            Table           NaN  400.0    NaN  80.0

In [121]:
pivot_df.reset_index()

          Category SubCategory Revenue        Profit
Store                                A      B      A     B
0      Electronics      Laptop     NaN    NaN    NaN   NaN
1      Electronics       Phone   200.0    NaN   50.0   NaN
2      Electronics          TV   300.0    NaN   70.0   NaN
3        Furniture       Chair     NaN  150.0    NaN  30.0
4        Furniture       Table     NaN  400.0    NaN  80.0